---
kind: property
id: P:Autodesk.Revit.DB.ViewSchedule.EmbeddedDefinition
zh: 明细表
source: html/d844369e-1bf1-28af-8d93-80a7e3f19cf8.htm
---
# Autodesk.Revit.DB.ViewSchedule.EmbeddedDefinition Property

**中文**: 明细表

The embedded ScheduleDefinition.

## Syntax (C#)
```csharp
public ScheduleDefinition EmbeddedDefinition { get; }
```